require 'socket'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'neovim/neovim'

brew 'aspell'
brew 'awscli'
brew 'bats'
brew 'cmake'
brew 'ffmpeg'
brew 'findutils'
brew 'fzf'
brew 'git'
brew 'gnu-tar'
brew 'graphviz'
brew 'httpie'
brew 'jq'
brew 'markdown'
brew 'neovim'
brew 'node'
brew 'openssl'
brew 'p7zip'
brew 'parallel'
brew 'python'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'rsync'
brew 'ruby-build'
brew 'sloccount'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'watch'
brew 'wget'
brew 'xz'
brew 'zsh'

cask 'anki'
cask 'firefox'
cask 'gifox'
cask 'istat-menus'
cask 'iterm2'
cask 'keepingyouawake'
cask 'kindle'
cask 'mactex'
cask 'skitch'
cask 'skype'
cask 'spectacle'
cask 'spotify'

case Socket.gethostname
when /seldon/i
  cask 'arq'
  cask 'cleanmymac'
end

# vim: filetype=ruby
